-- Test ADDRESS namespace switching for kitchen operations
-- 
-- Copyright (c) 2025 Paul Hammant
-- Licensed under the MIT License
createMeal potatoes=2 chicken=1

ADDRESS appliance
preheatOven temperature=350

ADDRESS kitchen
prepareDish name='Roasted Vegetables' servings=4